app/controllers/admin_controller.rb

SELECT "folders".* FROM "folders" WHERE "folders"."name" = '2005.02.26' ORDER BY "folders"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "images" WHERE "images"."folder_id" = 0
---
  def folders
    folders_on_fs = Dir.entries(ENV['IMG_PATH']) - [".", ".."]
    @folders = folders_on_fs.map {|z|
      folder_id = Folder.where(:name => z).first.nil? ? '' : Folder.where(:name => z).first.id
      {
        :id => folder_id,
        :name => z,
        :count => Image.where(:folder_id => folder_id).count,
        :fs_count => ImgHelper::FilesHelper.new(
          File.join(ENV['IMG_PATH'], z)).dir_contents.count