app/controllers/album_controller.rb

  def index
    @dirs = Folder.all.order(:name)
    @dirs = @dirs.map {|z| {:name => z.name,
                            :id => z.id,
                            :first_image => first_image(z.id, z.name)}}
---
SELECT "folders".* FROM "folders" ORDER BY "folders"."name" ASC
SELECT "folders".* FROM "folders"

  def dir
    @folder = Folder.find(params['id'])
---
SELECT "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT 1  [["id", "8"]]