app/controllers/img_controller.rb

SELECT "folders".* FROM "folders"
---
  def dirs
    render :json => Folder.all, :root => 'dir'

SELECT "folders".* FROM "folders" WHERE "folders"."id" = 8 ORDER BY "folders"."id" ASC LIMIT 1
---
  def last_updated
    f = Folder.where(:id => params['id']).first

SELECT images.*, exifs.date_time FROM "images" INNER JOIN "exifs" ON "exifs"."image_id" = "images"."id" WHERE "images"."folder_id" = 8 ORDER BY exifs.date_time DESC
SELECT "folders".* FROM "folders" WHERE "folders"."id" = 1 ORDER BY "folders"."id" ASC LIMIT 1
SELECT "images".* FROM "images" WHERE "images"."folder_id" = 3
---
  def images_in_dir
    images = Image.joins(:exif).where(:folder => Folder.find(params['id'])).
      select("images.*, exifs.date_time").
      order("exifs.date_time DESC").all
    updated_at = Folder.find(params['id']).updated_at
    f_name = Folder.find(params['id']).name

    images.each {|z| z.url = "http://#{ENV['IMG_SERVER']}/#{f_name}/#{z.name}"}